
# 중접된 리스트
mylist = [['가', '나', '다'], [4, 5, 6], 7, 8, 9]

# print(mylist) # [['가', '나', '다'], [4, 5, 6], 7, 8, 9]
# print(mylist[1]) # [4, 5, 6]
# print(mylist[1][1]) # 5

# mylist[1][1] = 99
# print(mylist) # [['가', '나', '다'], [4, 99, 6], 7, 8, 9]


a = [1,2,3,4]
b = [5,6,7,8]
c = ['a', 'b', 'c']
# list확장( 덧셈 )
print(a+b) # [1, 2, 3, 4, 5, 6, 7, 8]
print(a + [3,4,7]) # [1, 2, 3, 4, 3, 4, 7]
print(a + c) # [1, 2, 3, 4, 'a', 'b', 'c']

# list반복( 곱셈 )
print(c * 2) # ['a', 'b', 'c', 'a', 'b', 'c']      
print(a * 3) #  [1, 2, 3, 4, 1, 2, 3, 4, 1, 2, 3, 4]

